[GitHub Disk Utilization Over 70%]
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.digest_mode = 0
alert.suppress = 0
alert.track = 1
alert_condition = search disk_util > 70
counttype = custom
cron_schedule = 5 * * * *
disabled = 1
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.events.fields = ["source","sourcetype","eventtype","test","ticket","issue","issueNumber","mergeTime","reviewTime","sha","host"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.axisY.abbreviation = auto
display.visualizations.charting.chart = line
display.visualizations.charting.chart.nullValueMode = connect
display.visualizations.charting.fieldColors = {"Avg":"#1e93c6","Max":"#f2b827"}
display.visualizations.charting.fieldDashStyles = {"Avg":"Solid","Max":"Solid"}
display.visualizations.charting.legend.mode = seriesCompare
display.visualizations.custom.type = sunburst_viz.sunburst_viz
enableSched = 1
request.ui_dispatch_app = github_app_for_splunk
request.ui_dispatch_view = search
search = | mstats avg(_value) as "Avg" WHERE `github_collectd` AND metric_name="df.df_complex.*.value" AND plugin_instance=root AND host="*" span=10s BY metric_name, host\
| eval disk_gb = Avg / 1024 / 1024 / 1024\
| search metric_name !="*.reserved*"\
| eval metric_name=mvindex(split(metric_name,"."),2)\
| stats avg("disk_gb") as "Avg" by metric_name, host\
| xyseries host metric_name Avg\
| eval disk_total=used+free\
| eval disk_util=(used/disk_total)*100\
| fields host disk_util

[GitHub Disk Utilization Over 85%]
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.digest_mode = 0
alert.severity = 5
alert.suppress = 0
alert.track = 1
alert_condition = search disk_util > 85
counttype = custom
cron_schedule = 5 * * * *
disabled = 1
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.events.fields = ["source","sourcetype","eventtype","test","ticket","issue","issueNumber","mergeTime","reviewTime","sha","host"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.axisY.abbreviation = auto
display.visualizations.charting.chart = line
display.visualizations.charting.chart.nullValueMode = connect
display.visualizations.charting.fieldColors = {"Avg":"#1e93c6","Max":"#f2b827"}
display.visualizations.charting.fieldDashStyles = {"Avg":"Solid","Max":"Solid"}
display.visualizations.charting.legend.mode = seriesCompare
display.visualizations.custom.type = sunburst_viz.sunburst_viz
enableSched = 1
request.ui_dispatch_app = github_app_for_splunk
request.ui_dispatch_view = search
search = | mstats avg(_value) as "Avg" WHERE `github_collectd` AND metric_name="df.df_complex.*.value" AND plugin_instance=root AND host="*" span=10s BY metric_name, host\
| eval disk_gb = Avg / 1024 / 1024 / 1024\
| search metric_name !="*.reserved*"\
| eval metric_name=mvindex(split(metric_name,"."),2)\
| stats avg("disk_gb") as "Avg" by metric_name, host\
| xyseries host metric_name Avg\
| eval disk_total=used+free\
| eval disk_util=(used/disk_total)*100\
| fields host disk_util

[GitHub Load Average Above 1]
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.digest_mode = 0
alert.suppress = 0
alert.track = 1
alert_condition = search load.longterm > 1
counttype = custom
cron_schedule = 1 * * * *
disabled = 1
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.events.fields = ["source","sourcetype","eventtype","test","ticket","issue","issueNumber","mergeTime","reviewTime","sha","host"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.axisY.abbreviation = auto
display.visualizations.charting.chart = line
display.visualizations.charting.chart.nullValueMode = connect
display.visualizations.charting.fieldColors = {"Avg":"#1e93c6","Max":"#f2b827"}
display.visualizations.charting.fieldDashStyles = {"Avg":"Solid","Max":"Solid"}
display.visualizations.charting.legend.mode = seriesCompare
display.visualizations.custom.type = sunburst_viz.sunburst_viz
enableSched = 1
request.ui_dispatch_app = github_app_for_splunk
request.ui_dispatch_view = search
search = | mstats avg(_value) as "Avg" WHERE `github_collectd` AND metric_name="load.longterm" AND host="*" span=10s BY metric_name, host\
| stats avg(Avg) as "Load" by metric_name, host\
| xyseries host metric_name Load

[generate_user_access_lookup]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 6 * * *
description = This search will generate a lookup about the access to devsecops environment and write it to a lookup file
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","sc4s_container","sc4s_destport","sc4s_fromhostip","sc4s_proto","sc4s_syslog_facility","sc4s_syslog_format","sc4s_syslog_severity","sc4s_vendor_product","data.permission","permission","old_permission","user_id","action","app","user_agent","url","status","category","signature","COMMAND","USER","user"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = github_app_for_splunk
request.ui_dispatch_view = search
search = | pivot Change Auditing_Changes earliest(_time) AS "first_access" latest(_time) as "last_access" SPLITROW action SPLITROW command SPLITROW user SPLITROW object SPLITROW change_type SPLITROW object_category SPLITROW dvc\
| table first_access,last_access,user,command,action,dvc\
| outputlookup last_access_by_user
